{
  "users": [
    {
      "id": 1,
      "login": "writer3@mail.com",
      "password": 123456,
      "role": "writer"
    },
    {
      "id": 2,
      "login": "reader@mail.com",
      "password": 123456,
      "role": "reader"
    },
    {
      "id": 3,
      "login": "writer2@mail.com",
      "password": 123456,
      "role": "writer"
    }
  ],
  "posts": [
    {
      "id": "6f074bc7ccc81",
      "title": "МИД потребовал от США перестать вмешиваться во внутренние дела России",
      "description": "Министерство иностранных дел России обратилось к американским властям с требованием перестать вмешиваться во внутренние дела Москвы. Соответствующее заявление опубликовано на странице внешнеполитического ведомства в Facebook.\n\n«Грубое вмешательство США во внутренние дела России — такой же доказанный факт, как и \"раскрутка\" фейков и призывов к несанкционированным акциям подконтрольными Вашингтону интернет-платформами», — говорится в сообщении.\n\nВ МИД отметили, что нацеленные на поощрение протестов действия являются частью стратегии сдерживания России.\n\nРанее посол США Джон Салливан объяснил публикацию маршрутов несогласованных акций безопасностью американцев в России. По его словам, дипмиссия попросила их не приближаться к местам проведения акций, «потому что всегда есть вероятность того, что из мирного собрания демонстрация может превратиться в немирное».",
      "claps": 0,
      "createdAt": "2021-01-31T16:07:36.428Z",
      "updateAt": "2021-01-31T16:07:36.428Z",
      "userId": 1
    },
    {
      "id": "133eccb510c63",
      "title": "Полет Су-24 возле американского эсминца в Черном море попал на видео",
      "description": "На ролике видно, как российский самолет проходит на малой высоте вблизи эсминца «Дональд Кук», который был ранее направлен в акваторию Черного моря.\n\n«ВМС США регулярно работают в Черном море, чтобы заверить союзников и партнеров по НАТО [в приверженности своим обязательствам] и обеспечить безопасность и стабильность в регионе», — говорится в сообщении.\n\n23 января сообщалось, что американский боевой корабль «Дональд Кук» вошел в Черное море. Эсминец был взят на сопровождение силами и средствами Черноморского флота России. Вечером 28 января к нему присоединился эсминец ВМС США «Портер». В НАТО объяснили появление этих эсминцев «наращиванием военной мощи» России. \nКак то так",
      "claps": 0,
      "createdAt": "2021-02-01T16:37:06.897Z",
      "updateAt": "2021-02-01T16:40:18.308Z",
      "userId": 3
    },
    {
      "id": "537f2c823346f",
      "title": " Минздраве рассказали, в каких случаях пьяных будут помещать в вытрезвители",
      "description": "Важно отметить, что речь не идет о принудительном, недобровольном удержании граждан. Речь идет только о случаях, когда гражданин находится в беспомощном состоянии, обусловленном опьянением, а его жизни угрожает опасность, но при этом он не нуждается в оказании медицинской помощи. А теперь все печально.",
      "claps": 0,
      "createdAt": "2021-02-01T16:42:28.022Z",
      "updateAt": "2021-02-01T16:45:03.424Z",
      "userId": 3
    },
    {
      "id": "0a6e5c7293d0a",
      "title": "Испания приступила к пилотному проекту внедрения 4-дневной рабочей недели",
      "description": "В Испании началась разработка деталей пилотного проекта по переводу предприятий на 4-дневную рабочую неделю. Правительство одобрило испытания, в рамках которых компаниям предлагают финансовую помощь в случае, если они добровольно переведут персонал на 32-часовую рабочую неделю с сохранением зарплаты.",
      "claps": 0,
      "createdAt": "2021-02-01T17:10:56.711Z",
      "updateAt": "2021-02-01T17:10:56.711Z",
      "userId": 1
    },
    {
      "id": "64556ea1f4fee",
      "title": "В Краснодаре приступают к созданию пятого внутригородского округа",
      "description": "Новый округ будет расположен в границах Калининского сельского поселения (Прикубанский внутригородской округ), который охватывает большую часть Восточно-Кругликовского микрорайона.\n\n«Данный микрорайон и все прилегающие территории — это уже полноценный город. Управлять территорией из центра Прикубанского округа сложно. По численности населения Прикубанский округ превосходит Новороссийск. Цифры говорят сами за себя», — отметил господин Первышов.\n\nПо словам главы Краснодара, сейчас начнется этап создания специальной комиссии и подготовки необходимой документации. Также известно, что в рамках этой работы на базе бывшего общежития создадут административный корпус и отдел полиции..",
      "claps": 0,
      "createdAt": "2021-02-01T17:11:22.451Z",
      "updateAt": "2021-02-01T17:11:22.451Z",
      "userId": 1
    },
    {
      "id": "930a0a1f533bb",
      "title": "«Спутник» проверят на халяльность",
      "description": "Председатель Духовного управления мусульман Москвы Ильдар Аляутдинов объясняет, что даже если препараты признают нехаляльными, решение будет носить рекомендательный характер. Социальный антрополог, специализирующийся на исламе, Алена Никитичева предполагает, что «рекомендация» может повлиять на решение людей, если они изначально сомневаются в пользе вакцинации.\n\nСовет богословов Духовного управления мусульман (ДУМ) России запросил у директора Центра имени Гамалеи Александра Гинцбурга информацию о составе вакцины «Спутник V», чтобы вынести богословское решение о ее дозволенности. По словам заместителя председателя совета улемов (богословов), председателя ДУМ Москвы Ильдара Аляутдинова, к ним поступают «частые обращения от мусульман России относительно дозволенности или запретности вакцины с точки зрения ислама». С инициативой проверить российские препараты против коронавируса на халяльность выступил также муфтият Татарстана. Председатель комитета по стандарту «Халяль» при ДУМ республики",
      "claps": 0,
      "createdAt": "2021-02-01T17:11:55.799Z",
      "updateAt": "2021-02-01T17:11:55.799Z",
      "userId": 1
    },
    {
      "id": "ca6e5c964fcea",
      "title": "Красную Поляну и плато Лагонаки соединит вертолетный маршрут",
      "description": "Как сообщает пресс-служба администрации Сочи, туристы горнолыжного курорта смогут совершить вертолетный полет над заповедником, побывать на плато Лагонаки и вернуться. Авиамаршрут будут выполнять лицензированные авиакомпании.\n\nВ минувшие выходные состоялись пробный полет и тестирование экскурсионной программы. По мнению директора Кавказского государственного природного биосферного заповедника Сергея Шевелева, туристический маршрут быстро найдет почитателей.\n\n«Уверены, маршрут будет востребован среди наших гостей, поскольку появится возможность знакомства с объектом Всемирного природного наследия ЮНЕСКО — биосферным заповедником — с высоты птичьего полета», — отметила директор департамента курортов и туризма администрации города Сочи Светлана Батяйкина.\n",
      "claps": 0,
      "createdAt": "2021-02-01T17:13:01.361Z",
      "updateAt": "2021-02-01T17:13:01.361Z",
      "userId": 1
    },
    {
      "id": "7816b30b7b2c5",
      "title": "Пассажирский самолет вынуждено сел в Краснодаре из-за неисправности",
      "description": "31 января пассажирский самолет «Сухой Суперджет» вынужденно приземлился в Краснодаре. Воздушное судно вылетело из краевой столицы в Астрахань, но через полтора часа вернулось обратно. По некоторым данным, пилоты развернули лайнер из-за вибрации левого двигателя.\n\n— Экипаж рейса А4−339 «Краснодар-Астрахань» авиакомпании «Азимут», вылетевший в 15:21, доложил о технической неисправности. Самолет совершил штатную посадку в 16:51 в аэропорту вылета. Решением авиакомпании сделан размен бортов, рейс А4 339 будет выполняться на другом воздушном судне, — сообщили «Комсомольской правде — Кубань» в пресс-службе Международного аэропорта Краснодар.\n\nТакже в аэропорту отметили, что пассажиры вылетели в центр Астраханской области на запасном самолете в 18:37.\n\nРанее «Комсомолка» сообщала, почему воздушное судно в Сочи удалось посадить только с третьей попытки.",
      "claps": 0,
      "createdAt": "2021-02-01T17:13:35.062Z",
      "updateAt": "2021-02-01T17:13:35.062Z",
      "userId": 1
    },
    {
      "id": "729dc2cd09aac",
      "title": "2 дня назад, источник: Новая Кубань Экс вице-мэра Новороссийска Екатерину Демченко вновь уволили из ",
      "description": "Ранее стало известно о том, что бывший заместитель главы Новороссийска Екатерина Демченко, уволенная в прошлом году из-за шашлыков во время ограничений, вызванных коронавирусом, была назначена на должность руководителя МКУ «Управление строительства». Однако 30 января появилась информация о том, что на новом месте работы она уже не трудится.\n\n«С 19 по 28 января Екатерина Демченко исполняла служебные обязанности руководителя МКУ “Управление строительства”. На сегодняшний день в штате сотрудников не значится», — сообщили в пресс-службе мэрии города-порта.\n\nЧто стало причиной повторного назначения, а потом и увольнения — не сообщается.\n\nРанее «Новая Кубань» писала о том, как отреагировал глава города на инцидент с Екатериной Демченко. Игорь Дяченко в своем Instagram тогда написал, что новость о неподобающем поведении муниципального служащего не требует никаких комментариев.\n\n«Решение принципиальное, кардинальное и однозначное — заместитель Екатерина Демченко покидает свой пост», — написал ",
      "claps": 0,
      "createdAt": "2021-02-01T17:14:03.873Z",
      "updateAt": "2021-02-01T17:14:03.873Z",
      "userId": 1
    },
    {
      "id": "533b699755cf5",
      "title": "Путин призвал защитить интересы непрофессиональных инвесторов",
      "description": "Президент России Владимир Путин призвал защитить интересы неопытных инвесторов, которые вкладываются в рынок ценных бумаг. Глава государства потребовал не допустить повторения истории с обманутыми дольщиками.",
      "claps": 0,
      "createdAt": "2021-02-01T17:14:29.628Z",
      "updateAt": "2021-02-01T17:14:29.628Z",
      "userId": 1
    },
    {
      "id": "eabaa5255d16c",
      "title": "Путин впервые прокомментировал расследование о дворце в Геленджике",
      "description": "«Ничего из указанного там не принадлежит и не принадлежало ни мне, ни моим родственникам», — сказал он в ходе онлайн-встречи со студентами российских вузов в Татьянин день.\n\nПо словам главы государства, сам фильм о дворце он не смотрел из-за отсутствия свободного времени, однако листал видеоподборки, которые ему приносили помощники. Путин считает, что слухами о дворце россиянам пытались «промыть мозги».\n\nРанее пресс-секретарь президента России Дмитрий Песков назвал публикации о дворце «псевдоразоблачениями и информационными атаками», о которых давно было известно. Он также добавил, что каждый, кто смотрит эти материалы, должен «включить голову» и каждый раз спрашивать себя: «А при чем здесь Путин?».\n\nДо этого Песков называл публикации о дворце в Геленджике, который связывают с главой государства, «качественной клюквой». Он также предполагал, что главной целью публикаций является получение денег от граждан жульническим образом.",
      "claps": 0,
      "createdAt": "2021-02-01T17:15:00.361Z",
      "updateAt": "2021-02-01T17:15:00.361Z",
      "userId": 1
    }
  ]
}